# Bonus: Temperature Analysis I

In [1]:
import pandas as pd
from datetime import datetime as dt

In [2]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [3]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')

In [4]:
# Create a month name column
df['month_name'] = df['date'].dt.month_name()

In [5]:
# Set the date column as the DataFrame index
df.set_index('date', inplace=True)

In [6]:
df.head()

                station  prcp  tobs month_name
date
2010-01-01  USC00519397  0.08    65    January
2010-01-02  USC00519397  0.00    63    January
2010-01-03  USC00519397  0.00    74    January
2010-01-04  USC00519397  0.00    76    January
2010-01-06  USC00519397   NaN    73    January

In [7]:
# Drop the date column

### Compare June and December data across all years

In [8]:
from scipy import stats

In [9]:
# Filter data for desired months
june_df = df[(df['month_name'] == 'June')]
december_df = df[(df['month_name'] == 'December')]

In [10]:
# Identify the average temperature for June
june_df['tobs'].mean()

74.94411764705882

In [11]:
# Identify the average temperature for December
december_df['tobs'].mean()

71.04152933421226

In [12]:
# Create collections of temperature data
june_temps = june_df['tobs']
december_temps = december_df['tobs']

In [13]:
# Run paired t-test
stats.ttest_ind(june_temps, december_temps, equal_var=False)

Ttest_indResult(statistic=31.355036920962423, pvalue=4.193529835915755e-187)

### Analysis

Going by the t-statistic, we can reject the null hypothesis that there is no difference in the variances between the groups and accept the alternative hypothesis that there is a statistically significant difference in the variances between groups.

We used an independent paired t-test as we are using data from the same population.